package ls_11_23.ls_18_11_23;

/**
 * Сущность Man(имя, фамилия, возраст, количество детей, Адрес), Адрес(страна, город, улица, номер дома)
 *
 * Использовать коллекцию LinkedList. Действия для класса Адрес делать из класса Man.
 *  - Вывести информацию о всех людях.
 *  - Вывести информацию о всех адресах.
 *  - Вывести firstName, lastName, countOfChildren, когда возраст более или равно 20 и
 *  отсортировать по firstName.
 *  - Изменить firstName = 'John', lastName = 'Kennedi', countOfChildren = 3,
 *  когда country == 'US' (or another country).
 *  - Вывести firstName, lastName, nameOfStreet, когда country == 'Canada' AND numberOfHome == 3 OR age >= 25";
 *  - Сгруппировать людей по количеству детей.
 *  - Сгруппировать людей по количеству детей и возрасту.
 *  - Сгруппировать людей по городу и названию улицы.
 *  - Сгруппировать людей по городу и названию улицы и вывести количество адресов,
 *  где количество людей больше 4.
 */
public class TestMan {
    public static void main(String[] args) {

    }
}
